{"Douglas-Design-System":{"title":"Douglas Design System","links":["UP42"],"tags":[],"content":"A tokenized and accessible design system for UP42"},"Liberate-Science":{"title":"Liberate Science","links":["Hypergraph","ResearchEquals"],"tags":[],"content":"With funding from the Shuttleworth Foundation and support from Mozilla, Liberate Science seeks to provide an alternative to traditional scientific publishing through the collective power of open science.\n\nAs the founding designer, I lead the team in the creation of beautiful and accessible user interfaces and user experiences for both desktop and web.\nInitially, we were developed Hypergraph, a desktop application to facilitate peer-to-peer scientific research sharing and tracking built upon the Hypercore Protocol (now Holepunch).\nInformed by UX research insights, we pivoted to creating ResearchEquals, a centralized web-app for”as-you-go” instead of “after-the-fact” research sharing.\nSelected Projects §\n\nResearchEquals\nHypergraph\nA Manifesto to Liberate Science\n"},"UP42":{"title":"UP42","links":["Douglas-Design-System"],"tags":[],"content":"UP42 is a geospatial developer platform and marketplace for Earth observation data and analytics.\n\nI am leading the creation and adoption of the Douglas Design System, a state-of- the-art, tokenized and accessible design system and component library to empower and scale design and development across our organization.\nAdditionally, I am the product designer for the “Users Vertical” responsible for applying insights gained through both quantitative and qualitative means to the domains of onboarding, guidance, and credit and organization management.\nSelected Projects §\n\nDouglas Design System\nFlexible Purchase of Credits - Normalizing the Commercial Experience\nNotifications - In-app Visibility of System Status\nDashboard “Getting Started” Widget - An I/A bandaid\n"},"index":{"title":"Welcome","links":["California-Bay-Area","Berlin","UP42","Liberate-Science","Douglas-Design-System"],"tags":[],"content":"\nMy name’s Patrick Sobrak-Seaton. I am a product designer from the California Bay Area, but Berlin based since 2017.\nCurrently I am helping UP42 change the way we see the world through Earth observation data and analytics. Previously I was at Liberate Science looking to provide an alternative to traditional scientific publishing through the collective power of open science.\nSelected Works §\nUP42 §\n\n\n\nDouglas Design System\n\n\nFlexible Purchase of Credits - Normalizing the Commercial Experience\nNotifications - In-app Visibility of System Status\nDashboard “Getting Started” Widget - An I/A bandaid\n\nLiberate Science §\n\nResearchEquals\nHypergraph\nA Manifesto to Liberate Science\n"}}